Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: We refer you to the official documentation for a comprehensive list and detailed descriptions of all parameters.
zh_cn: 你可以查看官方文档获取全部配置参数列表及详细说明。

source: We show the structure and components of a typical Flink streaming application, discuss Flink’s type systems and the supported data types, and present data and partitioning transformations.
zh_cn: 我们将展示常见Flink流式应用的结构及组件，讨论Flink的类型系统和支持的数据类型并介绍数据转换（data transformation）和分区转换（partitioning transformation）操作。

source: We start by reviewing conventional data application architectures and point out their limitations.
zh_cn: 我们首先将回顾传统数据应用架构并指出其局限。

source: We start reviewing conventional data processing application architectures and point out their limitations.
zh_cn: 我们首先将回顾传统数据处理应用架构并指出其局限。

source: We start the discussion of this interface with a question: “Isn’t the 2PC protocol too expensive?”
zh_cn: 在详细讨论该接口之前，我们先来看一个问题："2PC协议代价是否过于昂贵？"

source: We started with a recap of traditional data infrastruc‐ tures, how business applications are commonly designed, and how data is collected and analyzed in most companies today.
zh_cn: 我们首先回顾了传统的数据基础架构，业务应用的常规设计以及当今大多数公司如何收集和分析数据。

source: We strongly recommend assigning unique identifiers to every operator of an applica‐ tion.
zh_cn: 我们强烈建议你像示例7-10中那样利用uid()方法为应用中的每个算子都分配唯一标识。

source: We use an example of a simple streaming application to explain the algorithm step by step.
zh_cn: 我们通过一个简单流式应用的示例来一步一步解释这个算法。

source: We will be assuming a UNIX-based setup in the rest of this chapter.
zh_cn: 我们假设本章其余部分的设置都是基于类UNIX系统来完成。

source: We will be using the Scala repository for the setup, but you should be able to follow the same instructions if you prefer Java.
zh_cn: 我们将选用Scala仓库进行设置，但如果你想用Java，也可以遵循同样的步骤。

source: We will briefly discuss the most common keyed state primitives.
zh_cn: 我们接下来简要讨论一下键值分区状态最常用的几个原语。

source: We will continue dis‐ cussing these common features by looking in detail at the KeyedProcessFunction.
zh_cn: 接下来我们会以KeyedProcessFunction为例来讨论函数的通用功能。

source: We will discuss the WAL mode in more detail later in this section.
zh_cn: 我们会在本节后面更详细地讨论WAL模式。

source: We will discuss the con‐ figuration and setup of Flink clusters in detail in Chapter 9.
zh_cn: 我们会在第9章讨论搭建和配置Flink集群的详细内容。

source: We will discuss the configuration and setup of Flink clusters in detail in Chapter 9.
zh_cn: 我们会在第9章讨论搭建和配置Flink集群的详细内容。

source: We will discuss the configuration of highly available Flink setups later in Chapter 9.
zh_cn: 我们稍后会在第9章节讨论Flink高可用相关配置。

source: We will discuss the configuration of highly available Flink setups later in “Highly Available Setups”.
zh_cn: 我们稍后会在"高可用性设置"一节讨论Flink高可用相关配置。

source: We will discuss the different state backends and their advantages and disadvantages in more detail in “Choosing a State Backend” on page 169.
zh_cn: 我们会在169页"选择状态后端"一节详细讨论不同状态后端的区别以及它们各自的优劣。

source: We will discuss the recovery mechanism in more detail later in this section.
zh_cn: 我们会在本节后面对其恢复机制进行更详细的讨论。

source: We will discuss this feature in more depth later in this section.
zh_cn: 我们会在本节后面部分讨论这个功能。

source: We will discuss this topic in more detail in “Application Consistency Guarantees” on page 184.
zh_cn: 我们会在184页"应用一致性保障"中详细讨论这一话题。

source: We will not go into the details of this mode, but among other things, a Docker Compose configuration needs to specify the network configuration so that Flink pro‐ cesses that run in isolated containers can communicate with each other.
zh_cn: 在此我们不会对该模式进行深入探讨，但要说明一点——Docker Compose脚本内需要指定网络配置以便使运行在独立容器中的Flink进程可以互相通信。

source: We will present Flink’s more sophisticated checkpointing algorithm later in this section.
zh_cn: 而是使用了一种更加复杂的检查点算法，我们会在本节后面介绍该算法。

source: We will provide you with a brief tour of the additional Flink function‐ ality not included in this book and give you some pointers to further Flink resources.
zh_cn: 我们将向你简要介绍书中没有涵盖的Flink其他功能，并为你提供更多Flink相关资源的信息。

source: We will show you how to collect metrics and monitor your applications and how to preserve result consistency when you want to update application code or adjust the resources of your application.
zh_cn: 我们将向你展示如何收集指标（metrics）和监控应用，以及如何在更新应用代码或调整应用资源时保持结果的一致性。

source: We will start by discussing the required software and where you can get the code examples of this book.
zh_cn: 我们会从所需软件以及怎样获取书中示例代码开始讲起。

source: We will take a brief look into the past to see where open source stream processing came from and where it is today.
zh_cn: 我们将通过简要地历史回顾来探索一下开源流处理技术的前世今生。

source: We will take a brief look into the past to see where open source stream pro‐ cessing came from and where it is today.
zh_cn: 在此，我们将通过简要的历史回顾来探索一下开源流处理技术的前世今生。

source: We will use this example to show‐ case the basic structure of a Flink program and introduce some important features of the DataStream API.
zh_cn: 我们将使用该示例展示Flink程序的基本结构并引出DataStream API中的几个重要特性。

source: We would like to thank and acknowledge some of them here.
zh_cn: 在此由衷地感谢。

source: We’ve also like to thank our technical reviewers who made countless valuable sugges‐ tions helping us to improve the presentation of the content.
zh_cn: 我们还要感谢那些给予我们无数宝贵建议的技术评审员们：Adam Kawa、Aljoscha Krettek、Kenneth Knowles、Lea Giordano、Matthias J. Sax、Stephan Ewen、Ted Malaska以及Tyler Akidau，感谢你们为改善内容所做的帮助。

source: What Does One Minute Mean in Stream Processing?
zh_cn: 流处理场景下一分钟的含义

source: What You Will Learn in This Book
zh_cn: 你能从本书学到什么

source: What happens when a trigger fires depends on the configured functions of the win‐ dow operator.
zh_cn: 触发器成功触发后的行为取决于窗口算子所配置的函数。

source: What is a task failure?
zh_cn: 什么是任务故障？

source: What is the meaning of one minute?
zh_cn: 分钟的含义

source: What should the application do?
zh_cn: 此时应用该怎么办？

source: What we have not discussed yet is the effect that watermarks have on your streaming
zh_cn: 但并没有涉及水位线对于流式应用的影响。

source: What would one minute really mean in the context of our streaming application?
zh_cn: 那么一分钟在流式应用的环境下到底是什么含义？

source: What’s more, by reducing the stream history to a single aggre‐
zh_cn: 此外，将整条历史流合并为单个聚合值会丢失数据随时间变化的信息。

source: What’s more, by reducing the stream history to a single aggre‐ gate, you lose the information about how your data varies over time.
zh_cn: 此外，将整条历史流合并为单个聚合值会丢失数据随时间变化的信息。

source: What’s more, streaming applications that process events as they are produced should also be able to
zh_cn: 此外，处理实时事件的流处理应用还应以相同的方式处理历史事件，这样才能支持离线分析、甚至那些比较不同历史区间的分析。

source: What’s more, streaming applica‐ tions that process events as they are produced should also be able to process historical events in the same way, thus enabling offline analytics or even time travel analyses.
zh_cn: 此外，处理实时事件的流处理应用还应以相同的方式处理历史事件，这样才能支持离线分析，甚至时间旅行式分析（time travel analyse）（译者注：利用重放对不同历史区间的数据进行分析）。

source: What’s more, when combined with re-playable streams, the determinism of time‐ stamps gives you the ability to fast-forward the past.
zh_cn: 而且结合可重放的数据流，时间戳的确定性允许你对历史数据"快进"。

source: What’s more, when combined with replayable streams, the determinism of timestamps gives you the ability to fast forward the past.
zh_cn: 而且结合可重放的数据流，时间戳所带来的确定性允许你对历史数据"快进"。

source: What’s the meaning of one minute in this case?
zh_cn: 在上述示例中一分钟的含义又是什么？

source: When Flink processes a data stream in event-time mode, it evaluates time-based operators based on the timestamps of records.
zh_cn: 当Flink以事件时间模式处理数据流时，会根据记录的时间戳触发时间相关算子的计算。

source: When GenericWriteAheadSink receives a notification about a completed checkpoint, it emits all records that are stored in the WAL in the segment corresponding to the
zh_cn: 当GenericWriteAheadSink接收到检查点完成通知时，会将WAL内所有对应该检查点的记录发出。

source: When a DataStream program is submitted to the JobManager for execution, the system creates a dataflow graph and prepares the operators for execu‐ tion.
zh_cn: 当提交一个DataStream程序到JobManager上执行时，系统会生成一个Dataflow图并准备好用于执行的算子。

source: When a JobManager fails, all tasks that belong to its application are automatically cancelled.
zh_cn: 当JobManager发生故障时，其下应用的所有任务都会自动取消。

source: When a JobManager requests TaskManager slots, the ResourceManager instructs a TaskManager with idle slots to offer them to the JobManager.
zh_cn: 当JobManager申请TaskManager处理槽时，ResourceManager会指示一个拥有空闲处理槽的TaskManager将其处理槽提供给JobManager。

source: When a StreamingFileSink receives a record, the record is assigned to a bucket.
zh_cn: 在StreamingFileSink接收到一条记录后，会将它分配到一个桶中。

source: When a checkpoint is triggered, the state backend creates a local copy of the state.
zh_cn: 当检查点生成过程触发时，状态后端会为当前状态创建一个本地拷贝。

source: When a checkpointed application fails, it will be restarted by bringing up its tasks, recovering their states, including the reading offsets of the source tasks, and continu‐ ing the processing.
zh_cn: 当一个生成过检查点的应用发生故障时，它会经过一系列步骤重启，具体包括：启动任务、恢复状态（包括数据源任务的读取偏移）和继续处理。

source: When a check‐ point is taken, MemoryStateBackend sends the state to the JobManager, which stores it in its heap memory.
zh_cn: 在生成检查点时，MemoryStateBackend会将状态发送至JobManager并保存到它的堆内存中。

source: When a container is started from the image, it automatically launches the ResourceManager and JobManager and submits the bundled job for execution.
zh_cn: 当容器从镜像启动后会自动加载ResourceManager和JobManager，并将绑定的作业提交执行。

source: When a container is started from this image, it automatically starts a TaskManager, which connects to the ResourceManager and registers its slots.
zh_cn: 当容器启动后会自动运行TaskManager，它负责连接ResourceManager并注册处理槽。

source: When a data source task receives the message, it pauses emitting records, triggers a checkpoint of its local state at the state backend, and broadcasts checkpoint barriers with the checkpoint ID via all outgoing stream partitions.
zh_cn: 当一个数据源任务收到消息后，会暂停发出记录，利用状态后端触发生成本地状态的检查点，并把该检查点分隔符连同检查点编号广播至所有传出的数据流分区。

source: When a file is completely ingested and a checkpoint completed, it can be removed from the directory.
zh_cn: 当文件读取完成且系统成功生成检查点后，你可以将文件从目录中删除。

source: When a function registers a StateDescriptor, Flink checks if the state backend has data for the function and a state with the given name and type.
zh_cn: 当函数注册StateDescriptor时，Flink会检查状态后端是否包含了函数的数据以及与给定名称、类型相同的状态。

source: When a function registers state, the state store tries
zh_cn: 在函数进行状态注册时，

source: When a job fin‐ ishes, the result is written to persistent storage, and all operator state is lost.
zh_cn: 当一个作业结束，其结果就会写入持久化存储中，同时所有算子的状态将不复存在。

source: When a job finishes, the result is written to persistent storage, and all operator state is lost.
zh_cn: 每当一个作业结束，其结果都会写入持久化存储中，同时所有算子的状态将不复存在。

source: When a job is submitted for execution, the Dispatcher starts a JobManager thread, which requests slots from Flink’s ResourceManager.
zh_cn: 当接收到一个提交执行的任务时，Dispatcher会启动一个JobManager线程，负责从Flink的ResourceManager申请处理槽。

source: When a job is submitted to the Dispatcher, it spawns a JobManager thread, which requests processing slots from the ResourceManager.
zh_cn: Dispatcher在收到一个提交的作业后，会启动一个JobManager线程用以从ResourceManager请求处理槽。

source: When a late element arrives within the allowed lateness period it is handled like an on-time element and handed to the trigger.
zh_cn: 在这段额外时间内到达的迟到元素会像按时到达的元素一样交给触发器处理。

source: When a new element is received, the ReduceFunction is called with the new element and the current value that is read from the window’s state.
zh_cn: 每当收到一个新元素，算子都会以该元素和从窗口状态取出的当前聚合值为参数调用ReduceFunction，

source: When a pod is restarted after a failure or when deployments are scaled up or down, the IP address can change.
zh_cn: 当Pod从故障中重启或Deployment进行扩缩容后，它们的IP地址可能会发生变化。

source: When a program is submitted for execution, all function objects are serialized using Java serialization and shipped to all parallel tasks of their corresponding operators.
zh_cn: 当程序提交执行时，所有参数对象都会利用Java自身的序列化机制进行序列化，然后发送到对应算子的所有并行任务上。

source: When a savepoint is taken, the states of all tasks are copied to a persistent storage location.
zh_cn: 在生成保存点的时候，所有任务的状态都会拷贝到某个持久化存储位置上。

source: When a sender task and a receiver task run in the same TaskManager process, the sender task serializes the outgoing records into a byte buffer and puts the buffer into a queue once it is filled.
zh_cn: 当发送任务和接收任务处于同一个TaskManager进程时，发送任务会将要发送的记录序列化到一个字节缓冲区中，一旦该缓冲区占满就会被放到一个队列里。

source: When a sink task receives a barrier, it performs a barrier alignment, checkpoints its own state, and acknowledges the reception of the barrier to the JobManager.
zh_cn: 数据汇任务在收到分隔符后会依次执行分隔符对齐，将自身状态写入检查点，向JobManager确认已接收分隔符等一系列动作。

source: When a sink task receives the barrier, it persists its state, prepares the current transaction for committing, and acknowledges the checkpoint at the JobMan‐ ager.
zh_cn: 当数据汇任务收到分隔符时，它会将内部状态持久化，为当前事务的提交做好准备，并向JobManager发送检查点的确认消息。

source: When a sink task receives the notification, it commits all open transactions of previous checkpoints.8 Once a sink task acknowledges its checkpoint, it must be able to commit the corre‐ sponding transaction, even in the case of a failure.
zh_cn: 数据汇任务在收到通知后，会提交所有和之前检查点相关、处于开启状态的事务。8 一旦它确认完成了检查点就必须能够提交相应的事务，故障情况下也不例外。

source: When a task processes a record, it automatically scopes the state access to the
zh_cn: 当任务在处理一个记录时，会自动把状态的访问范围限制为当前记录的键值。

source: When a task receives a barrier for a new checkpoint, it waits for the arrival of barriers from all its input partitions for the checkpoint.
zh_cn: 当任务收到一个新检查点的分隔符时，会继续等待所有其它输入分区也发来这个检查点的分隔符。

source: When a task receives a checkpoint completion notification, it writes the records of the completed checkpoints to the external system.
zh_cn: 当一个任务接收到检查点完成通知时，会将此次检查点周期内的所有记录写入外部系统。

source: When a task receives a record that violates the watermark property and has smaller time‐ stamps than a previously received watermark, it might be the case that the computa‐ tion it would belong to has already been completed.
zh_cn: 当任务接收到一个违反水位线属性、时间戳小于前一个水位线的记录时，该记录本应参与的计算可能已经完成。

source: When a task receives a record that violates the watermark property and has smaller time‐ stamps than a previously received watermark, it may be that the computation it belongs to has already been completed.
zh_cn: 当任务收到一个违反水位线属性，即时间戳小于或等于前一个水位线的记录时，该记录本应参与的计算可能已经完成。

source: When a task receives a watermark, the following actions take place.
zh_cn: 当任务接收到一条水位线记录时会执行以下操作。

source: When a task receives a watermark, the following actions take place:
zh_cn: 当任务接收到一个水位线时会执行以下操作：

source: When a timer fires, the onTimer() callback function is called.
zh_cn: 计时器触发时会调用onTimer()回调函数。

source: When a window is deleted, the window operator automatically clears the window content and discards the window object.
zh_cn: 当窗口需要删除时，窗口算子会自动清除窗口内容并丢弃窗口对象。

source: When a worker pod fails, Kubernetes will automatically restart the failed pod and the application will be recovered (given that checkpointing was activated and properly configured).
zh_cn: 当工作进程Pod发生故障时，Kubernetes会自动重启故障的Pod并恢复应用（前提是已经配置好并激活检查点）。

source: When all records have been successfully emitted, the corresponding checkpoint must be inter‐ nally committed.
zh_cn: 当所有记录成功发出后，数据汇需要在内部提交对应的检查点。

source: When an application is executed, all of its dependencies must be available to the application.
zh_cn: 应用在执行时，必须能够访问到所有依赖。

source: When an application is started from a savepoint, Flink redistributes the savepoint data to the tasks of the corresponding operators.
zh_cn: 当应用从保存点启动时，Flink会将保存点的数据分发到对应算子的任务上。

source: When an application is started from a savepoint, the identifiers are used to map a state in the savepoint to the corresponding operator of the started application.
zh_cn: 当应用从保存点启动时，会利用这些标识将保存点中的状态映射到目标应用对应的算子。

source: When an application is started from a savepoint, the operators of the started applica‐ tion are initialized by looking up the corresponding states from the savepoint using operator identifiers and state names.
zh_cn: 当应用从保存点启动时，它的算子会使用算子标识和状态名称从保存点中查找对应的状态进行初始化。

source: When an application is submitted for execution, Flink’s type system tries to automati‐ cally derive the TypeInformation for every data type that is processed by the frame‐ work.
zh_cn: 当应用提交执行时，Flink的类型系统会为框架所需处理的每种类型自动推断TypeInformation。

source: When an application is submitted, the responsible Dispatcher starts a JobManager thread that stores its metadata in the configured persistent storage and a pointer in Zoo‐ Keeper as discussed before.
zh_cn: 在应用提交时，当前负责的Dispatcher会启动一个JobManager线程。该线程会像之前介绍的那样将它的元数据存储在配置好的持久化存储中，并将路径写入ZooKeeper。

source: When an application receives an event, it can perform arbitrary computations that involve reading data from or writing data to the state.
zh_cn: 应用收到事件后可以执行包括读写状态在内的任意计算。

source: When an application receives an event, it can perform arbi‐ trary computations that involve reading data from or writing data to the state.
zh_cn: 应用收到事件后可以执行包括读写状态在内的任意计算。

source: When an container is started from the image, it automatically launches the ResourceManager and the JobMan‐ ager and hands over the bundled job.
zh_cn: 当容器从映像启动后会自动加载ResourceManager和JobManager，并提交绑定的作业。

source: When an element arrives at a window operator, it is handed to the WindowAssigner.
zh_cn: 当一个元素进入窗口算子时会被移交给WindowAssigner。

source: When an event is processed, an application reads its state or updates it by running transac‐ tions against the remote database system.
zh_cn: 期间每处理一条事件，应用都会通过执行远程数据库系统的事务来读取或更新状态。

source: When an event is processed, an application reads its state or updates its state by run‐ ning transactions against the remote database system.
zh_cn: 期间每处理一条事件，应用都会通过远程数据库系统的事务来读取或更新状态。

source: When an operator receives a watermark with time T, it can assume that no further events with timestamp less than T will be received.
zh_cn: 当一个算子接收到时间为T的水位线，就可以认为不会再收到任何时间戳小于或等于T的事件了。

source: When an operator receives a watermark with time T, it can assume that no further events with time‐ stamp less than T will be received.
zh_cn: 当一个算子接收到时间为T的水位线，就可以认为不会再收到任何时间戳小于或等于T的事件了。

source: When an operator receives the bar‐ rier, it checkpoints it state and sends an acknowledgment message to the JobManager once it is done.
zh_cn: 当算子收到到分隔符时，它会将内部状态写入检查点，并在工作完成后向JobManager发送确认消息。

source: When applied on a KeyedStream with an evolving key space, Global Windows will maintain some state for each key.
zh_cn: 当把GlobalWindows应用于一个键值空间不断变化的KeyedStream时，它会为每个键值维持一些状态。

source: When applied on a windowed stream, ReduceFunction incrementally aggregates the elements that are assigned to a window.
zh_cn: 当被用在窗口化数据流上时，ReduceFunction会对分配给窗口的元素进行增量聚合。

source: When asked for a new watermark, the assigner returns a watermark with the maximum timestamp minus a 1-minute tolerance interval.
zh_cn: 当收到新水位线请求时，该分配器会返回一个时间戳等于最大时间戳减去1分钟容忍间隔的水位线。

source: When being deployed on a container orchestration framework, such as Kubernetes, the framework restarts failed contain‐ ers.
zh_cn: 当部署在容器编排框架（如Kubernetes）上时，框架会重启失败的容器。

source: When building applications with the DataStream API the sys‐ tem automatically chooses data partitioning strategies and routes data to the correct destination depending on the operation semantics and the configured parallelism.
zh_cn: 在使用DataStream API构建程序时，系统会根据操作语义和配置的并行度自动选择数据分区策略并将数据转发到正确的目标。

source: When configuring the memory setting of a TaskManager, you should size the JVM heap memory so there is enough memory left for the JVM nonheap memory (classes and metadata) and RocksDB if it is configured as a state backend.
zh_cn: 在为TaskManager配置内存时，你应该适当调整JVM堆内存的大小，以便为JVM非堆内存（用于类和元数据）和RocksDB（如果选它作状态后端）留下足够多的内存。

source: When dealing with a potentially unbounded stream of continuously arriving events, time becomes a central aspect of applications.
zh_cn: 当处理一个持续到达且可能无穷的事件流时，时间便成了应用中最为核心的要素。

source: When discarding pending files it does not reuse
zh_cn: 它在丢弃一些处于等待阶段的文件时，将不会重用它们的ID。

source: When enabled, state backends also store a copy of the checkpoint data on the local disk of their worker node in addition to writing the data to the remote storage system.
zh_cn: 在该功能启用后，状态后端除了将数据写入远程存储系统外，还会将检查点数据在工作进程所在节点的本地磁盘复制一份，

source: When instructed by the ResourceManager, the TaskManager offers one or more of its slots to a JobManager.
zh_cn: 当接收到ResourceManager的指示时，TaskManager会向JobManager提供一个或多个处理槽。

source: When it receives a watermark from a partition, it updates the respective partition watermark to be the maximum of the received value and the current value.
zh_cn: 当收到某个分区传来的水位线后，任务会以接收值和当前值中较大的那个去更新对应分区水位线的值。

source: When it receives the notification that a check‐ point completed, it commits the transaction and materializes the written results.
zh_cn: 直至收到检查点完成通知后，数据汇才会通过提交事务将结果物化。

source: When iterating over the entry set of MapState, the seri‐ alized entries are prefetched from RocksDB and only deserialized when a key or value
zh_cn: 在遍历MapState的条目集（entry set）时，状态后端会从RocksDB中预取出序列化好的所有条目，并只有在实际访问某个键或数据值的时候才会将其反序列化。

source: When merging windows, you need to ensure that the state of all merging windows and their triggers is also appropriately merged.
zh_cn: 在合并窗口时，需要保证所有目标窗口的状态以及它们的触发器也能够正确合并。

source: When none of the predefined partitioning strategies is suitable, you can define your own by using the partitionCustom() method.
zh_cn: 如果所有预定义的分区策略都不合适，你可以利用partitionCustom()方法自己定义分区策略。

source: When operating in high- availability mode, the JobManager writes the JobGraph and all required metadata, such as the application’s JAR file, into a remote persistent storage system.
zh_cn: JobManager在高可用模式下工作时，会将JobGraph以及所有所需的元数据（例如应用的JAR文件）写入一个远程持久化存储系统中。

source: When operating in high-availability mode, the JobManager writes the JobGraph and all required metadata, such as the application’s JAR file, into a remote persistent storage system.
zh_cn: JobManager在高可用模式下工作时，会将JobGraph以及所有所需的元数据（例如应用的JAR文件）写入到一个远程持久化存储系统中。

source: When port forwarding is running, you can access the Web UI at http://localhost:8081.
zh_cn: 在端口转发运行过程中，可以通过http://localhost:8081访问Web UI。

source: When presenting the transformations of the DataStream API, we show the interfaces for all function classes, but mostly use lambda functions instead of function classes in code examples for brevity.
zh_cn: 在介绍DataStream API的转换时，我们会展示所有函数类的接口。但为了简洁，在绝大多数示例代码中我们会使用Lambda函数而不是函数类。

source: When properly configured, you will find the following log message in the TaskManager logs:
zh_cn: 正确配置后，你会在TaskManager的日志中看到以下信息：

source: When reading from Kafka version 0.10 or later, the consumer will automatically extract the message timestamp as an event-time timestamp if the application runs in event-time mode.
zh_cn: 因此，当我们从0.10之后的版本读取数据时，如果应用运行在事件时间模式下，消费者会自动提取消息的时间戳作为事件时间的时间戳。

source: When reading from multiple topics, the Kafka connector treats all partitions of all topics the same and multiplexes their events into a single stream.
zh_cn: 当选择多个主题时，Kafka连接器会对所有主题的分区一直同仁，并将它们的事件混合成为一条数据流。

source: When recovering from a fail‐ ure, the offsets are restored and the source instance continues reading from the checkpointed offset.
zh_cn: 在进行故障恢复时，数据源实例将恢复那些写入检查点的偏移，并从它们指示的位置继续读取数据。

source: When run without additional parameters, the client prints a help message.
zh_cn: 如果在调用时没有提供额外运行参数，客户端会打印帮助消息。

source: When running Flink on Kubernetes with a master deployment and a worker deploy‐ ment as described in “Kubernetes” on page 228, Kubernetes will automatically restart failed containers to ensure the right number of pods is up and running.
zh_cn: 正如我们在第228页"Kubernetes"一节中介绍的那样，当在Kubernetes上使用主进程Deployment及工作进程Deployment启动Flink时，Kubernetes将自动重启故障容器以确保Pod运行数目的正确性。

source: When running a data processing system such as Flink in production, it is essential to monitor its behavior to be able to discover and diagnose the cause of performance degradations.
zh_cn: 当你在生产环境中运行像Flink这样的数据处理系统时，必须监控其行为，以便能发现并诊断性能下降的原因。

source: When running an application as a library deployment in a container environment, such as Kubernetes, failed JobManager or TaskManager containers are usually auto‐ matically restarted by the container orchestration service.
zh_cn: 当在容器环境（如：Kubernetes）中将应用作为库部署运行时，容器编排服务通常会自动重启故障的JobManager或TaskManager容器。
